renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hstorage_driver.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2014(2019) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hstorage_driver.c
 * Description  : USB Host Storage Driver
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 08.01.2014 1.00 First Release
 *         : 26.12.2014 1.10 RX71M is added
 *         : 30.09.2015 1.11 RX63N/RX631 is added.
 *         : 30.09.2016 1.20 RX65N/RX651 is added.
 *         : 26.01.2017 1.21 usb_hmsc_strg_drive_search_act is fixed.(Add MBR(sect0) dummy read)
 *         : 31.03.2018 1.23 Supporting Smart Configurator 
 *         : 31.05.2019 1.26 Added support for GNUC and ICCRX.
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
#include <string.h>

#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_extern.h"
#include "r_usb_hmsc_if.h"
#include "r_usb_hmsc.h"
#if (BSP_CFG_RTOS_USED == 1)
#include "FreeRTOS.h"
#endif /*BSP_CFG_RTOS_USED == 1 */

#if defined(USB_CFG_HMSC_USE)

/******************************************************************************
Macro definitions
******************************************************************************/
#define RETRY_COUNT (10)

/******************************************************************************
 Private global variables and functions
 ******************************************************************************/
uint16_t g_usb_hmsc_strg_process[USB_NUM_USBIP];

/* static uint8_t g_usb_hmsc_data[USB_NUM_USBIP][64];*/     /* Full-Speed MAXPS */
static uint8_t g_usb_hmsc_data[USB_NUM_USBIP][512];    /* Hi-Speed MAXPS */
#if (BSP_CFG_RTOS_USED == 0)
/* Partition */
static uint16_t g_usb_hmsc_read_partition_retry_count[USB_NUM_USBIP];
#endif  /* BSP_CFG_RTOS_USED == 0 */

static usb_cb_t usb_shmsc_command_result[USB_NUM_USBIP];
static uint16_t usb_shmsc_command_end_flag[USB_NUM_USBIP];

uint16_t    g_usb_hmsc_root_devaddr[USB_NUM_USBIP];
uint16_t    g_usb_hmsc_drive_search_seq[USB_NUM_USBIP];

/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/
extern uint8_t g_drive_search_que[];
extern uint8_t g_drive_search_que_cnt;

/******************************************************************************
 Renesas Abstracted Peripheral Driver functions
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_strg_drive_search_act
 Description     : Storage drive search
 Arguments       : usb_utr_t *mess   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void usb_hmsc_strg_drive_search_act (usb_utr_t *mess)
{
    static uint16_t side;
    uint16_t addr;
    usb_er_t err;
    uint16_t ipno_devaddr;

    switch (g_usb_hmsc_drive_search_seq[mess->ip])
    {
        case USB_SEQ_0 : /* Get MAX_LUN */
            USB_PRINTF0("\n*** Drive search !\n");
            g_usb_hmsc_strg_process[mess->ip] = USB_MSG_HMSC_STRG_DRIVE_SEARCH;
            addr = mess->keyword;
            ipno_devaddr = addr;
            if ( USB_IP1 == mess->ip)
            {
                ipno_devaddr |= USBA_ADDRESS_OFFSET;
            }
            side = usb_hmsc_ref_drvno(ipno_devaddr);

            if (USB_ERROR == side)
            {
                g_usb_hmsc_drive_search_seq[mess->ip] = USB_SEQ_0;
                g_usb_hmsc_strg_process[mess->ip] = USB_MSG_HMSC_STRG_DRIVE_SEARCH_END;
                usb_hmsc_strg_specified_path(mess);
                usb_hstd_connect_err_event_set(mess->ip);
            }
            else
            {
                err = usb_hmsc_get_max_unit(mess, addr, g_usb_hmsc_data[mess->ip], usb_hmsc_strg_check_result);
                if (USB_QOVR == err)
                {
                    usb_hmsc_message_retry( USB_HSTRG_MBX, mess);
                }
                else
                {
                    g_usb_hmsc_drive_search_seq[mess->ip]++;
                }
            }
        break;

        case USB_SEQ_1 : /* Check result */
            if ( USB_CTRL_END != mess->result)
            {
                USB_PRINTF0("### GetMaxLUN error\n");
            }
            USB_PRINTF1(" Unit number is %d\n", g_usb_hmsc_data[mess->ip][0] );
            USB_PRINTF0("\nPlease wait device ready\n");
            usb_cpu_delay_xms(100);

