renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_hmsc/src/r_usb_hstorage_driver.c
        case USB_MSG_HMSC_STRG_RW_END :
            if (USB_HMSC_OK == p_mess->result)
            {
                usb_shmsc_command_end_flag[p_mess->ip] = USB_TRUE;
            }
            else
            {
                usb_shmsc_command_end_flag[p_mess->ip] = USB_ERROR;
            }
        break;

        default :
        break;
    }

    err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )p_mess);
    if (USB_OK != err)
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }
}
#endif /* (BSP_CFG_RTOS_USED == 0) */
/******************************************************************************
 End of function usb_hmsc_strg_drive_task
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED)
/******************************************************************************
 Function Name   : hmsc_error_process
 Description     : Error processing when CSW error is retuned by MSC device.
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     side        : Drive number
                 : uint16_t     err_code    : Error code
 Return value    : uint16_t                 : Error code
 ******************************************************************************/
static uint16_t hmsc_error_process (usb_utr_t *ptr, uint16_t side, uint16_t err_code)
{
    uint16_t    retval;
    static uint8_t g_usb_hmsc_rs_data[512]; /* Request Sense Data Buffer */

    retval = err_code;

    if (USB_HMSC_CSW_ERR == err_code)
    {
        retval = usb_hmsc_request_sense(ptr, side, g_usb_hmsc_rs_data);
    }
    
    return retval;
}
/******************************************************************************
 End of function hmsc_error_processing
 ******************************************************************************/
#endif /* BSP_CFG_RTOS_USED */

/******************************************************************************
 Function Name   : usb_hmsc_strg_drive_search
 Description     : Searches drive SndMsg
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure.
                 : uint16_t     addr        : Device Address
                 : usb_cb_t     complete    : Callback function
 Return value    : uint16_t                 : Status
 ******************************************************************************/
uint16_t usb_hmsc_strg_drive_search (usb_utr_t *ptr, uint16_t addr, usb_cb_t complete)
{
#if (BSP_CFG_RTOS_USED)
    usb_er_t err;
    uint16_t side;
    uint16_t ipno_devaddr;
    uint16_t hmsc_retval;
    uint16_t count = 0;

    USB_PRINTF0("\n*** Drive search !\n");

    g_usb_hmsc_root_devaddr[ptr->ip] = addr;
    usb_shmsc_command_result[ptr->ip] = complete;

    /* Get MAX_LUN */
    ipno_devaddr = addr;
    if ( USB_IP1 == ptr->ip)
    {
        ipno_devaddr |= USBA_ADDRESS_OFFSET;
    }

    side = usb_hmsc_ref_drvno(ipno_devaddr);
    if (USB_ERROR == side)
    {
        return USB_ERROR;
    }

    err = usb_hmsc_get_max_unit(ptr, addr, g_usb_hmsc_data[ptr->ip], usb_hmsc_trans_result);
    if (USB_ERROR == err)
    {
        USB_PRINTF0("### GetMaxLUN error\n");
        return err;
    }
    USB_PRINTF1(" Unit number is %d\n", g_usb_hmsc_data[mess->ip][0] );
    USB_PRINTF0("\nPlease wait device ready\n");

    usb_cpu_delay_xms(100);

    /* Inquiry */
    hmsc_retval = usb_hmsc_inquiry(ptr, side, (uint8_t*) &g_usb_hmsc_data[ptr->ip]);
    if (USB_HMSC_OK != hmsc_retval)
    {
        hmsc_retval = hmsc_error_process(ptr, side, hmsc_retval);
        if (USB_HMSC_OK != hmsc_retval)
        {
            return USB_ERROR;
        }
    }

    /* Read Format Capacity */
    hmsc_retval = usb_hmsc_read_format_capacity(ptr, side, (uint8_t*) &g_usb_hmsc_data[ptr->ip]);
    if (USB_HMSC_OK != hmsc_retval)
    {
        hmsc_retval = hmsc_error_process(ptr, side, hmsc_retval);
        if (USB_HMSC_OK != hmsc_retval)
        {
            return USB_ERROR;
        }
    }

    /* Read Capacity */
    hmsc_retval = usb_hmsc_read_capacity(ptr, side, (uint8_t*) &g_usb_hmsc_data[ptr->ip]);
    if (USB_HMSC_OK != hmsc_retval)
    {
        hmsc_retval = hmsc_error_process(ptr, side, hmsc_retval);
        if (USB_HMSC_OK != hmsc_retval)
        {
            return USB_ERROR;
        }

        /* WAIT_LOOP */
        while (1)
        {
            /* TestUnitReady */
            hmsc_retval = usb_hmsc_test_unit(ptr, side);

            if (USB_HMSC_OK == hmsc_retval)
            {
                /* Read Capacity (Retry) */
                hmsc_retval = usb_hmsc_read_capacity(ptr, side, (uint8_t*) &g_usb_hmsc_data[ptr->ip]);
                break;
            }
            else
            {
                hmsc_retval = hmsc_error_process(ptr, side, hmsc_retval);
                if (USB_HMSC_OK != hmsc_retval)
                {
                    return USB_ERROR;
                }
            }
        }
    }

    /* Don't delete the following processing!! */
    /* (This is necessary for the specific USB memory.) */
    /* Read10 secno = 0, seccnt = 1 */
    /* WAIT_LOOP */
    for (count = 0;; count++)
    {
        if (RETRY_COUNT != count)
        {
            hmsc_retval =  usb_hmsc_read10 (ptr, side, (uint8_t*)&g_usb_hmsc_data[ptr->ip], 0, 1, USB_HMSC_STRG_SECTSIZE);
            if (USB_HMSC_OK == hmsc_retval)
            {
                break;
            }
        }
        else
        {
            return USB_ERROR;
        }
    }

    /* Storage Drive Search completed. */
    (usb_shmsc_command_result[ptr->ip])((usb_utr_t *) ptr, g_usb_hmsc_root_devaddr[ptr->ip], 0);

    return USB_OK;

#else /* (BSP_CFG_RTOS_USED) */
    usb_utr_t *p_blf;
    usb_er_t err;

    g_usb_hmsc_root_devaddr[ptr->ip] = addr;
    usb_shmsc_command_result[ptr->ip] = complete;
    g_usb_hmsc_drive_search_seq[ptr->ip] = USB_SEQ_0;

    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK (USB_HSTRG_MPL, &p_blf))
    {
        p_blf->msginfo = USB_MSG_HMSC_STRG_DRIVE_SEARCH;
        p_blf->keyword = addr;
        p_blf->complete = complete;
        p_blf->ip = ptr->ip;
        p_blf->ipp = ptr->ipp;

        /* Send message */
        err = USB_SND_MSG(USB_HSTRG_MBX, (usb_msg_t* )p_blf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HSTRG_MPL, (usb_mh_t )p_blf);
            USB_PRINTF0("### StrgDriveSearch function snd_msg error\n");
        }
    }
    else
    {
        /* Error */
        /* WAIT_LOOP */
        while (1)
        {
            /* error */
        }
    }
    return (err);
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_strg_drive_search
 ******************************************************************************/

